//機房預約系統

//學校有幾個部圖規格的機房 起開發一套預約系統解決撞車問題

//三種身分
/*
學生	申請使用
教師	審核申請
管理	創建學生與教室帳號
*/

//-------------------------------------------------------------

//機房簡介
/*
一號房	最大20人
二號房  最大50人
三號房  最大100人
*/

//-------------------------------------------------------------

//申請簡介
/*
申請的訂單每周由管理員負責清空
學生可預約未來一周的使用 日期為周一至周五 需選定上午或下午
教師審核預約  通過或不通過
*/

//-------------------------------------------------------------

//系統具體需求
/*	登錄介面 可選為
學生
教師
管理
退出
*/

/*	登錄驗證
學生	學號 姓名 密碼
教師	編號 姓名 密碼
管理	姓名 密碼
*/

/*	學生功能
申請預約
查看自身預約
查看所有預約
取消預約
*/